{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ConvPRE_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ConvPRE_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvPRE", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BN_A_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BN_A_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ACT_A_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CONV_A_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CONV_A_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "CONV_A_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BN_B_0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BN_B_0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ACT_B_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CONV_B_0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CONV_B_0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "CONV_B_0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[21, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BN_A_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_A_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BN_A_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ACT_A_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CONV_A_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CONV_A_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "CONV_A_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BN_B_1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BN_B_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BN_B_1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "ACT_B_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CONV_B_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CONV_B_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "CONV_B_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[40, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "FinalBN_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "FinalBN_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "FinalBN_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "FinalBN_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "FinalBN", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "FinalACT", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "FinalConv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "FinalConv_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "FinalConv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    38, 
    39, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    52
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64
  ], 
  "heads": [[53, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}